Tekla Open API Reference for Tekla Structures 2025
Vector Fields
The Vector type exposes the following members.
Fields
Name | Description
X
 The X-coordinate of the point.
 (Inherited from Point.)
Y
 The Y-coordinate of the point.
 (Inherited from Point.)
Z
 The Z-coordinate of the point.
 (Inherited from Point.)
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace